Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/boards_of_management.html.txt.tmx
Source language: en
Languages: ga

source: Boards of management in primary schools
ga: Boird bhainistíochta i mbunscoileanna

source: Primary schools have had boards of management since 1975
ga: Tá boird bhainistíochta ag bunscoileanna ó 1975

source: The Education Act 1998 put the system on a statutory basis and set out the responsibilities of the boards
ga: Tugann an tAcht Oideachais 1998 stádas reachtúil don chóras agus leagann sé síos dualgais na mbord

source: Primary schools are not obliged to have boards of management
ga: Níl aon dualgas ar bhunscoileanna bord bainistíochta a cheapadh

source: The patron of the school has the right to decide whether or not to have one
ga: Tá sé de cheart ag an bpatrún cinneadh a dhéanamh an mbeidh nó nach mbeidh ceann ag an scoil

source: In practice, most primary schools do have boards
ga: Ach, i ngníomh, tá bord bainistíochta ag formhór na mbunscoileanna

source: Under the Education Act 1998, the patron is obliged 'for the purposes of ensuring that a recognised school is managed in a spirit of partnership' to appoint, where practicable, a board of management
ga: Tá dualgas ar an bpatrún, atá leagtha síos san Acht Oideachais 1998, 'ar mhaithe le cinntiú go bhfuil scoil aitheanta dá bhainistí i spiorad na páirtnéireachta', chomh fada agus is féidir, bord bainistíochta a cheapadh

source: The composition of the board of management is to be agreed between school patrons, national associations of parents, school management organisations, teacher representatives and the Minister for Education and Skills
ga: Ní mór do phatrún na scoile déantús an bhord bainistíochta a aontú leis na cumainn náisiúnta tuismitheoirí, eagraíochtaí bainistíochta na scoileanna, ionadaithe na múinteoirí agus leis an Aire

source: The board is appointed by the patron
ga: Is é an patrún a cheapann an bord

source: In making appointments, the patron must comply with Ministerial directions about gender balance
ga: Ní mór don phatrún cloí le treoracha an Aire maidir le cothromaíocht idir fhir agus mhná ar an mbord nuair atá na ceapucháin dhá ndéanamh

source: If the patron decides that it is not practicable to appoint a board, he/she must give reasons to the parents, teachers, staff and the Minister but he/she cannot be forced to appoint one
ga: Má déanann an patrún cinneadh nach bhfuil sé indéanta bord bainistíochta a cheapadh, ní mór dó/dí fáthanna a thabhairt do na tuismitheoirí, don fhoireann agus don Aire ach ní féidir iachall a chur air/uirthi bord a cheapadh

source: The board's main function is to manage the school on behalf of the patron and for the benefit of the students and to provide an appropriate education for each student at the school
ga: Is í príomhfheidhm an bhoird an scoil a bhainistí ar son an phatrúin agus ar mhaithe leis na daltaí agus le hoideachas cuí a chur ar fáil do chuile dhalta sa scoil

source: The board is accountable to the patron and the Minister for Education and Skills
ga: Tá an Bord freagrach don phátrún agus don Aire Oideachais

source: The school principal is responsible for the day-to-day management of the school and is accountable to the board
ga: Tá príomhoide na scoile freagrach as bainistíocht laethúil na scoile agus tá siad freagrach don Bhord

source: In carrying out its functions, the board must
ga: Ní mor don bhord:

source: • Act in accordance with Ministerial policy
ga: • Gníomhú de réir polasaithe an Aire

source: • Uphold the ethos of the school and be accountable to the patron for this
ga: • Seasamh le meon na scoile agus a bheith freagrach don phatrún maidir leis

source: The word ethos is not used in the Education Act 1998
ga: Ní baintear usáid as an bhfocal meon san Acht Oideachais 1998

source: It is described in the Act as the 'characteristic spirit of the school as determined by the cultural, educational, moral, religious, social, linguistic and spiritual values and traditions which inform and are characteristic of the objectives and conduct of the school'
ga: Déantar cur síos san Acht air mar 'spiorad sainiúil na scoile atá leagtha síos sa bhéim a leagtar ar chúrsaí cultúrtha, oideachasúla, morálta, creidimh, sóisialta, teanga agus spioradálta agus traidisiúin a thugann eolas agus atá de réir tréithe agus iompar na scoile'

source: • Act in accordance with the law and with any deed, charter, or similar instrument relating to the school
ga: • Gníomhú de réir an dlí agus aon ghníomhas, cairt, nó ionstraim den chineál seo a bhaineann leis an scoil

source: • Consult with and inform the patron of decisions and proposals
ga: • Dul i gcomhairle leis an bpatrún agus insint dó faoi aon chinnithe nó moltaí

source: • Publish the school's policy on admission to and participation in the school, including its policy on expulsion and suspension of students, admission and participation by students with disabilities or with other special educational needs
ga: • Polasaí na scoile maidir le rialacha iontrála agus páirtíochta, a polasaí ar dhíbirt agus ar fhionraí san áireamh, iontráil agus pairtíocht daltaí le míchumas nó le riachtanais eile speisialta oideachais a fhoilsiú

source: • Ensure that the school's admissions policy respects the choices of parents and the principles of equality and that it complies with Ministerial directions, having regard to the school ethos and the constitutional rights of all concerned
ga: • Déanamh cinnte go bhfuil an polasaí iontrála ag cloí le roghanna na dtuismitheoirí agus le prionsabail an chomhionannais agus le treoracha an Aire, i gcomhthéasc meon na scoile agus cearta bunreachtúla na ndaoine ar fad lena mbaineann an scoil

source: • Have regard for the principles and requirements of a democratic society and promote respect for the diversity of values, beliefs, traditions, languages and ways of life in our society
ga: • Smaoineamh ar phrionsabail agus ar riachtanais atá ag ár sochaí daonlathach agus meas ar chúrsaí creidimh, traidisiúin, teangacha agus nósanna éagsúla saoil sa tsochaí a chothú

source: • Have regard to the efficient use of resources (particularly the grants provided by the State), the public interest in the affairs of the school and accountability to students, parents and the community
ga: • Breathnú ar an mbealach is éifeachtaí le hacmhainní na scoile a úsáid (go háirid maidir le deontais atá curtha ar fáil ag an Stát), ar an bpáirt atá ag an bpobal i ngníomhachtaí na scoile agus a bheith freagrach do na daltaí, tuismitheoirí agus don phobal

source: • Use the resources provided by the State to make reasonable provision and accommodation for students with disabilities or special needs, including, if necessary, the adaptation of buildings or provision of special equipment
ga: • Úsáid a bhaint as na hacmhainní a chuireann an Stát ar fáil le soláthar réasúnta a chur ar fáil do dhaltaí le míchumas nó le riachtanais speisialta, san áireamh, más gá, athchóiriú a dhéanamh ar na foirgnimh agus trealamh speisialta a chur ar fáil

source: How boards of management operate
ga: Modh oibre atá ag boird bhainistíochta

source: The role and method of operation of boards of management of primary schools was agreed by the Department of Education, the school managers, parents and teachers in 2003
ga: D'aontaigh an Roinn, bainisteoirí na scoileanna, tuismitheoirí agus múinteoirí an ról agus modh oibre na mbord bainistíochta i mbunscoileanna sa bhliain 2003

source: The Constitution of Boards and Rules of Procedure (pdf), revised in 2011, sets out the key activities of the Board
ga: Leagann Bunreacht na mBord agus Rialacha Nós Imeachta (pdf), a leasaíodh in 2011, príomhghníomhaíochtaí an Bhoird

source: Essentially, the board manages the school
ga: Go bunúsach, bíonn an bord ag bainistí na scoile

source: • It has responsibility for drawing up the school plan and for ensuring that it is implemented
ga: • Tá sé freagrach as plean na scoile a chur le chéile agus as a chinntiú go gcuirtear i bhfeidhm é

source: • It appoints the principal, the teachers and other staff
ga: • Ceapann sé an príomhoide, na múinteoirí, agus baill eile den fhoireann

source: • It must ensure that the school fulfils its functions as set out in the Education Act 1998
ga: • Ní mór dó a chinntiú go gcomhlíonann an scoil a feidhmeanna mar atá leagtha síos san Acht Oideachais 1998

source: • It must promote contact between the school, the parents and the community and must facilitate and give all reasonable help to a parents' association in its formation and its activities
ga: • Ní mór dó teagmháil idir an scoil, na tuismitheoirí agus an pobal a chur chun cinn agus glacadh le cumann tuismitheoirí chomh maith le cúnamh a thabhairt an cumann a bhunú agus dá ghníomhachtaí

source: • It has overall responsibility for the school's finances
ga: • Tá freagracht air i dtaobh airgead na scoile

source: It is obliged to have comprehensive insurance cover for the school
ga: Tá sé de dhualgas air a chinntiú go bhfuil árachas cuimsitheach ag an scoil

source: It must keep proper accounts, which may be audited by the Department of Education and Skills and/or the Comptroller and Auditor General
ga: Ní mór cuntais chuí a choinneáil, gur féidir leis an Roinn Oideachais agus Scileanna agus/nó an Ard-Reachtaire Cuntas agus Ciste iniúchadh a dhéanamh orthu

source: Its annual accounts must be available to the patron and the school community
ga: Ní mór do na cuntais bhliantúla a bheith ar fáil don phatrún agus do phobal na scoile

source: • It must ensure that child protection and welfare are taken into account in all of the school’s policies, practices and activities
ga: • Ní mór dóibh a chinntiú go gcuirtear cosaint agus leas leanaí san áireamh i ngach ceann de bheartais, cleachtais agus gníomhaíochtaí na scoile

source: The board must ensure that the Child Protection Procedures for Primary and Post Primary Schools are fully implemented by the school
ga: Ní mór don Bhord a chinntiú go gcuireann an scoil Nósanna Imeachta um Chosaint Leanaí do Bhunscoileanna agus Meánscoileanna i bhfeidhm go hiomlán

source: • It must ensure the school has a Code of Behaviour and an anti-bullying policy
ga: • Ní mór dóibh a chinntiú go bhfuil Cód Iompair agus beartas frithbhulaíochta i bhfeidhm ag an scoil

source: The board must have a procedure for informing parents about its activities – this could include an annual report
ga: Ní mór don bhord bealach a bheith aige le tuismitheoirí a choinneáil ar an eolas maidir lena ghníomhachtaí - tuairisc bhliantúil san áireamh mar shampla

source: More information on boards of management is available on the website of the Department of Education and Skills
ga: Tá tuilleadh faisnéise ar fáil ar shuíomh na Roinne Oideachais agus Scileanna

source: Who is on the board
ga: Cé atá ar an mbord

source: The composition of the board of management for schools with more than one teacher is
ga: Seo a leanas déantús na mbord bainistíochta i scoileanna a bhfuil níos mó ná beirt mhúinteoir iontu:

source: • Two direct nominees of the patron
ga: • Beirt ainmnithe ag an bpatrún

source: • Two parents of children enrolled in the school (one mother and one father) elected by the parents
ga: • Máthair agus athair tofa ag na tuismitheoirí

source: • One other teacher elected by the teaching staff
ga: • Múinteoir amháin eile tofa ag an bhfoireann teagaisc

source: • Two extra members agreed by the representatives of the patron, teachers and parents
ga: • Beirt den phobal aontaithe ag ionadaithe an phatrúin, múinteoirí agus tuismitheoirí

source: There are particular rules for boards of management for convent and monastery schools in relation to the teacher representatives
ga: Tá rialacha faoi leith a bhaineann le boird bhainistíochta i scoileanna clochair agus mainistreach maidir le hionadaithe na múinteoirí

source: If the principal is a religious, the elected teacher-member must be a lay person and, if the principal is a lay person, it is recommended that the elected teacher-member be a religious
ga: Más duine rialta é/í an príomhoide ní mór gur duine tuaithe é/í an múinteoir eile atá tofa ar an mbord, agus más duine tuaithe é/í an príomhoide, tá sé molta gur duine rialta den fhoireann teagaisc a bheadh tofa ina (h)ionadaí eile do na múinteoirí

source: In one-teacher schools, there is one direct nominee of the patron, one teacher representative, one parent and one extra member proposed by these nominees
ga: I scoileanna aon-oide ní bhíonn ar an mbord, ar ndóigh, ach múinteoir amháin agus tuismitheoir amháin

source: There are certain criteria set out for choosing the 2 community representatives on the board of management
ga: Tá rialacha faoi leith leagtha síos maidir leis an mbeirt ionadaí ón bpobal a phiocadh don bhord bainistíochta

source: • The people appointed must have a commitment to the ethos of the school
ga: • Ní mór do na daoine a roghnaítear a bheith ceangailte le meon na scoile

source: In the case of Catholic schools, they must have an understanding of and commitment to Catholic education as outlined in the Deed of Trust for Catholic Schools
ga: I gcás scoileanna Caitliceacha, ní mór dóibh tuiscint a bheith acu agus a bheith ceangailte le hoideachas Caitliceach mar atá leagtha síos sa Ghníomhas Iontaobhais do Scoileanna Caitliceacha

source: For Church of Ireland schools, they must be members of that Church; in Presbyterian schools, they must also be church members and in Muslim schools they should be members of the Muslim community in Ireland (in all cases the patron of the school can decide otherwise)
ga: I gcás scoileanna d'Eaglais na hÉireann, ní mór dóibh a bheith ina mbaill den Eaglais sin; i scoileanna Preispitéireacha ní mór dóibh freisin a bheith ina mbaill den Eaglais sin ach amháin sa chás go ndéanann an patrún a mhalairt de chinneadh

source: • They must have skills that are complementary to the board's requirements
ga: • Ní mór dóibh scileanna a bheith acu atá feiliúnach do riachtanais an bhoird

source: • They must be interested in education but normally should not be parents of students currently attending the school or teachers currently on the staff
ga: • Ní mór dóibh spéis a bheith acu san oideachas, ach, go hiondúil, nach tuismitheoirí iad de dhaltaí atá ag freastal ar an scoil ag an am, ná muinteoirí ag teagasc ag an am sa scoil

source: • In Gaeltacht schools and Gaelscoileanna, they are expected to have a good knowledge of the Irish language
ga: • I scoileanna Gaeltachta agus i nGaelscoileanna, ní mór dóibh líofacht mhaith a bheith i nGaeilge acu

source: • The need to maintain a gender balance must be a consideration
ga: • Ní mór smaoineamh i gcónaí ar an riachtanas cothromaíocht a bheith ann idir fhir agus mhná

source: The patron appoints the chairman of the board
ga: Ceapann an patrún cathaoirleach an bhoird

source: The Rules set out in detail how the parents' representatives are to be chosen, including the notice to be given to all parents, how replacements are chosen, etc
ga: Tá mionchuntas sna rialacha ar an mbealach le hiondaithe na dtuismitheoirí a roghnú, san áireamh an fógra nach mór a thabhairt do na tuismitheoirí uilig, an modh oibre le folúntais a líonadh & rl

source: In general, members of the board may not hold any interest in the school property or get paid for serving on the board
ga: Go ginearálta, ní féidir le baill an bhoird aon pháirt a bheith acu i maoin na scoile nó íocaíocht a fháil as feidhmiú ar an mbord

source: The Education Act 1998 explicitly clarifies that being on the board does not confer any property interest on a board member
ga: Tá sé soiléir san Acht Oideachais 1998 nach bhfuil aon pháirt i maoin na scoile bronnta ar bhaill nuair a thagann siad ar an mbord

source: Employees, other than the teacher representatives, may not be on the board
ga: Ní féidir le fostaithe na scoile, taobh amuigh d'ionadaithe na múinteoirí, a bheith ar an mbord

source: The following people are not eligible for membership of a board:
ga: Ní féidir leis na daoine seo a leanas a bheith ina mbaill de bhord:

source: • A person who is an undischarged bankrupt or was involved in a court procedure for settling with creditors in the previous 3 years or
ga: • Clisiúnach nó duine a raibh baint aige/aici le cás cúirte le creidiúnaithe shásamh le trí bliana anuas

source: • A person who received a prison sentence in the previous 5 years
ga: • Duine a dhaoradh chuig an bpríosún le cúig bhliana anuas

source: Term of office of the board
ga: Tréimhse oifige an bhoird

source: The term of office for a board is 4 years and members can hold office only for 4 years although members are eligible for reappointment when their term of office expires
ga: Ceithre bliana a mhaireann tréimhse oifige an bhoird agus cé nach dtoghtar oifigigh ach ar feadh ceithre bliana is féidir iad a atoghadh nuair atá a dtréimhse oifige caite
